Autodesk.Revit.DB.SlabShapeVertex.VertexType
The type of the vertex.

Autodesk.Revit.DB.SlabShapeVertex.Position
The position of the vertex.

Autodesk.Revit.DB.SlabShapeVertex
A vertex used in Slab Shape Editing.